Revit 2027 API
ParameterTypeId.WallBottomIsAttached Property
 "Base is Attached"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId WallBottomIsAttached { get; }
Public Shared ReadOnly Property WallBottomIsAttached As ForgeTypeId
	Get
public:
static property ForgeTypeId^ WallBottomIsAttached {
	ForgeTypeId^ get ();
}
static member WallBottomIsAttached : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace